---
kind: method
id: M:Autodesk.Revit.DB.STLExportOptions.IsValidForSurfaceTolerance(System.Double)
source: html/1befecc7-5532-fd55-4d81-e923ad4acba4.htm
---
# Autodesk.Revit.DB.STLExportOptions.IsValidForSurfaceTolerance Method

Checks whether the value is allowed (is in the allowed range) for SurfaceTolerance tessellation parameter.

## Syntax (C#)
```csharp
public static bool IsValidForSurfaceTolerance(
	double value
)
```

## Parameters
- **value** (`System.Double`) - The value to be checked.

## Returns
True if the value is valid for SurfaceTolerance, false otherwise.